project_planning/unidb.org
#+STARTUP: indent
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+TITLE:     UniDB
#+AUTHOR:    John Brestelli
#+DESCRIPTION: UniDB
#+OPTIONS:   H:5 num:nil toc:2 p:t tags:not-in-toc
* B53 :JohnB:
** DONE Site Configuration
- [X] (Cristina) confiugre beta and qa sites to use "uni-build-53" and uni053n
** DONE Workflow Changes
- [X] Remove step copy to webservices and download files
** DONE Schema Changes
- [X] study.study study_id and investigation_id need to be number(8)
- [X] Add "database_orig" and "primary_key_orig" fields to every table in "Core.TableInfo"
- [X] Add Index on each table for 3 fields (pk, pk_orig, db_orig)
- [X] new script to add fields after apidbschema has been made.  last script when creating apidb schema
  #+begin_src sql
   BEGIN
   FOR item in (select di.name || '.' || di.name as table_name
                     , ti.primary_key_column
                     , di.name || '_' || di.name || '_map' as index_name
                     from (-- everything but version and userdataset schemas
                     select  t.*
                     from core.tableinfo t, core.databaseinfo d
                     where lower(t.table_type) != 'version'
                     and t.DATABASE_ID = d.DATABASE_ID
                     and d.name not in ('UserDatasets', 'ApidbUserDatasets', 'chEBI', 'hmdb')
                     and t.name not in ('AlgorithmParam','GlobalNaturalKey','DatabaseTableMapping','SnpLinkage', 'CompoundPeaksChebi')
                     minus
                     -- minus Views on tables
                     select * from core.tableinfo where view_on_table_id is not null
                     ) ti, core.databaseinfo di
                     where ti.database_id = di.database_id   )
   LOOP
    ALTER table item.table_name add database_orig varchar2(30), primary_key_orig number(20);
    CREATE INDEX index_name ON item.table_name (database_orig, primary_key_orig, item.primary_key_column) tablespace indx; 
   END LOOP;
   END;
  #+end_src
** DONE ApiCommonDatasts
- [X] configure only dbs which have been exported for b53
- [X] bld ApiCommonDatasts and generateFromDatasets
** DONE Plugin Changes for Sequence Variations
- [X] Skip ApiDB.SequenceVariation
  - ~ 58 hours to load 633 mil rows from Plasmo (fungi has > 1.3 billion rows)
    #+BEGIN_EXAMPLE
    Sun Apr  4 18:22:17 2021	Begin ID Lookup for ApiDB::SequenceVariation from database plas051n
    Sun Apr  4 18:24:35 2021	Finished ID Lookup for ApiDB::SequenceVariation from database plas051n
    Sun Apr  4 18:29:19 2021	Processed 100000 from ApiDB::SequenceVariation
    Sun Apr  4 18:29:55 2021	Processed 200000 from ApiDB::SequenceVariation
    ....
    Wed Apr  7 05:30:14 2021	Processed 633000000 from ApiDB::SequenceVariation
    Wed Apr  7 05:30:44 2021	Processed 633100000 from ApiDB::SequenceVariation
    Wed Apr  7 05:30:48 2021	Finished Reading data from ApiDB::SequenceVariation
    Wed Apr  7 05:30:48 2021	Finished Loading 633110728 Rows into table ApiDB::SequenceVariation from database plas051n
    #+END_EXAMPLE
** DONE Tuning Manager                                               :JohnB:
- [X] SNPAttributes (ok for b53 but will be missing some fields)
- [X] SNPStrains (update sql so it doesn't use SequenceVariation)
  #+begin_src sql
	select * from study.protocolappnode where name like '% (Sequence Variation)'
  #+end_src
** DONE Model                                                        :MarkH:
- [X] Using include/exclude projects make the snpattributes which are missing internal for b53
