project_planning/unidb.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 18 May. 2022 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>UniDB</title>
<meta name="author" content="John Brestelli" />
<meta name="description" content="UniDB" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<main id="content" class="content">
<header>
<h1 class="title">UniDB</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org90e82d7">B53</a>
<ul>
<li><a href="#org570581f"><span class="done DONE">DONE</span> Site Configuration</a></li>
<li><a href="#org529c4b1"><span class="done DONE">DONE</span> Workflow Changes</a></li>
<li><a href="#orgadc5361"><span class="done DONE">DONE</span> Schema Changes</a></li>
<li><a href="#org838a49c"><span class="done DONE">DONE</span> ApiCommonDatasts</a></li>
<li><a href="#orgbc820c2"><span class="done DONE">DONE</span> Plugin Changes for Sequence Variations</a></li>
<li><a href="#orge104b6a"><span class="done DONE">DONE</span> Tuning Manager</a></li>
<li><a href="#org75f54a9"><span class="done DONE">DONE</span> Model</a></li>
<li><a href="#org55270a5"><span class="done DONE">DONE</span> FeatureLocation Patch</a></li>
<li><a href="#orgff9a23d"><span class="done DONE">DONE</span> MassSpecFeature Patch</a></li>
<li><a href="#org98ebdaa">Punt</a></li>
</ul>
</li>
<li><a href="#org7cdc4b4">B54</a>
<ul>
<li><a href="#org6379634"><span class="done DONE">DONE</span> Genomics Workflow Changes</a></li>
<li><a href="#org2f51c24"><span class="done DONE">DONE</span> Bulk Loader for SNP / Seqvars</a></li>
<li><a href="#org2a46de9"><span class="done DONE">DONE</span> Add Mass Spec profile (Llinas) redmine:45318</a></li>
<li><a href="#org6075e7d"><span class="done DONE">DONE</span> Update SRes.Taxon and SRes.TaxonName with most recent  version of NCBI Taxonomy</a></li>
<li><a href="#orgb487704"><span class="done DONE">DONE</span> Undo unidbcomponents</a></li>
<li><a href="#org4696329"><span class="done DONE">DONE</span> Patch ids for other tables ( uni-inc, uni054n )</a></li>
</ul>
</li>
<li><a href="#orgdd1435b">Beta Release</a>
<ul>
<li><a href="#orgbf1914a">Automated QA Process</a></li>
<li><a href="#org6acd342">Performance Tests</a></li>
</ul>
</li>
<li><a href="#orgb0725ae">Future Releases</a>
<ul>
<li><a href="#orgb275df2"><span class="todo TODO">TODO</span> Schema Changes</a></li>
<li><a href="#orgbb1e3cb">Plugin Changes for DatabaseMapping fields</a></li>
<li><a href="#org512a0d8">Tuning Manager</a></li>
<li><a href="#org7d26bb3">Model (JBrowse, WDK, WS Plugins, &#x2026;)</a></li>
<li><a href="#org43932e3">wgcna (host /pathogen)</a></li>
</ul>
</li>
<li><a href="#org5df38a4">SOP for schema changes</a></li>
<li><a href="#org9ee9c32">Use Cases For Unified Database</a>
<ul>
<li><a href="#org7772408">ebi2GUS</a></li>
</ul>
</li>
<li><a href="#orgdcdcd2e">Other Documentation</a></li>
<li><a href="#org45341d7">Table Reader(s)</a></li>
</ul>
</div>
</nav>
<section id="outline-container-org90e82d7" class="outline-2">
<h2 id="org90e82d7">B53&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnB">JohnB</span></span></h2>
<div class="outline-text-2" id="text-org90e82d7">
</div>
<div id="outline-container-org570581f" class="outline-3">
<h3 id="org570581f"><span class="done DONE">DONE</span> Site Configuration</h3>
<div class="outline-text-3" id="text-org570581f">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> (CristinaA) confiugre beta and qa sites to use &ldquo;uni-build-53&rdquo; and uni053n</li>
</ul>
</div>
</div>
<div id="outline-container-org529c4b1" class="outline-3">
<h3 id="org529c4b1"><span class="done DONE">DONE</span> Workflow Changes</h3>
<div class="outline-text-3" id="text-org529c4b1">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> Remove step copy to webservices and download files</li>
</ul>
</div>
</div>
<div id="outline-container-orgadc5361" class="outline-3">
<h3 id="orgadc5361"><span class="done DONE">DONE</span> Schema Changes</h3>
<div class="outline-text-3" id="text-orgadc5361">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> study.study study_id and investigation_id need to be number(8)</li>
<li class="on"><input type='checkbox' checked='checked' /> Add &ldquo;database_orig&rdquo; and &ldquo;primary_key_orig&rdquo; fields to every table in &ldquo;Core.TableInfo&rdquo;</li>
<li class="on"><input type='checkbox' checked='checked' /> Add Index on each table for 3 fields (pk, pk_orig, db_orig)</li>
<li class="on"><input type='checkbox' checked='checked' /> <p>
new script to add fields after apidbschema has been made.  last script when creating apidb schema
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">BEGIN</span>
<span class="org-keyword">FOR</span> item <span class="org-keyword">in</span> (<span class="org-keyword">select</span> di.<span class="org-keyword">name</span> || <span class="org-string">'.'</span> || di.<span class="org-keyword">name</span> <span class="org-keyword">as</span> <span class="org-keyword">table_name</span>
                  , ti.primary_key_column
                  , di.<span class="org-keyword">name</span> || <span class="org-string">'_'</span> || di.<span class="org-keyword">name</span> || <span class="org-string">'_map'</span> <span class="org-keyword">as</span> index_name
                  <span class="org-keyword">from</span> (<span class="org-comment">-- everything but version and userdataset schemas</span>
                  <span class="org-keyword">select</span>  t.*
                  <span class="org-keyword">from</span> core.tableinfo t, core.databaseinfo d
                  <span class="org-keyword">where</span> <span class="org-builtin">lower</span>(t.table_type) != <span class="org-string">'version'</span>
                  <span class="org-keyword">and</span> t.DATABASE_ID = d.DATABASE_ID
                  <span class="org-keyword">and</span> d.<span class="org-keyword">name</span> <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-string">'UserDatasets'</span>, <span class="org-string">'ApidbUserDatasets'</span>, <span class="org-string">'chEBI'</span>, <span class="org-string">'hmdb'</span>)
                  <span class="org-keyword">and</span> t.<span class="org-keyword">name</span> <span class="org-keyword">not</span> <span class="org-keyword">in</span> (<span class="org-string">'AlgorithmParam'</span>,<span class="org-string">'GlobalNaturalKey'</span>,<span class="org-string">'DatabaseTableMapping'</span>,<span class="org-string">'SnpLinkage'</span>, <span class="org-string">'CompoundPeaksChebi'</span>)
                  minus
                  <span class="org-comment">-- minus Views on tables</span>
                  <span class="org-keyword">select</span> * <span class="org-keyword">from</span> core.tableinfo <span class="org-keyword">where</span> view_on_table_id <span class="org-keyword">is</span> <span class="org-keyword">not</span> <span class="org-keyword">null</span>
                  ) ti, core.databaseinfo di
                  <span class="org-keyword">where</span> ti.database_id = di.database_id   )
LOOP
 <span class="org-keyword">ALTER</span> <span class="org-keyword">table</span> item.<span class="org-keyword">table_name</span> <span class="org-keyword">add</span> database_orig varchar2(30), primary_key_orig <span class="org-keyword">number</span>(20);
 <span class="org-keyword">CREATE</span> INDEX index_name <span class="org-keyword">ON</span> item.<span class="org-keyword">table_name</span> (database_orig, primary_key_orig, item.primary_key_column) tablespace indx; 
<span class="org-keyword">END</span> LOOP;
<span class="org-keyword">END</span>;
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org838a49c" class="outline-3">
<h3 id="org838a49c"><span class="done DONE">DONE</span> ApiCommonDatasts</h3>
<div class="outline-text-3" id="text-org838a49c">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> configure only dbs which have been exported for b53</li>
<li class="on"><input type='checkbox' checked='checked' /> bld ApiCommonDatasts and generateFromDatasets</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc820c2" class="outline-3">
<h3 id="orgbc820c2"><span class="done DONE">DONE</span> Plugin Changes for Sequence Variations</h3>
<div class="outline-text-3" id="text-orgbc820c2">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> Skip ApiDB.SequenceVariation
<ul class="org-ul">
<li><p>
~ 58 hours to load 633 mil rows from Plasmo (fungi has &gt; 1.3 billion rows)
</p>
<pre class="example" id="orgb011aef">
Sun Apr  4 18:22:17 2021	Begin ID Lookup for ApiDB::SequenceVariation from database plas051n
Sun Apr  4 18:24:35 2021	Finished ID Lookup for ApiDB::SequenceVariation from database plas051n
Sun Apr  4 18:29:19 2021	Processed 100000 from ApiDB::SequenceVariation
Sun Apr  4 18:29:55 2021	Processed 200000 from ApiDB::SequenceVariation
....
Wed Apr  7 05:30:14 2021	Processed 633000000 from ApiDB::SequenceVariation
Wed Apr  7 05:30:44 2021	Processed 633100000 from ApiDB::SequenceVariation
Wed Apr  7 05:30:48 2021	Finished Reading data from ApiDB::SequenceVariation
Wed Apr  7 05:30:48 2021	Finished Loading 633110728 Rows into table ApiDB::SequenceVariation from database plas051n
</pre></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge104b6a" class="outline-3">
<h3 id="orge104b6a"><span class="done DONE">DONE</span> Tuning Manager&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnB">JohnB</span></span></h3>
<div class="outline-text-3" id="text-orge104b6a">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> SNPAttributes (ok for b53 but will be missing some fields)</li>
<li class="on"><input type='checkbox' checked='checked' /> <p>
SNPStrains (update sql so it doesn&rsquo;t use SequenceVariation)
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> * <span class="org-keyword">from</span> study.protocolappnode <span class="org-keyword">where</span> <span class="org-keyword">name</span> <span class="org-keyword">like</span> <span class="org-string">'% (Sequence Variation)'</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org75f54a9" class="outline-3">
<h3 id="org75f54a9"><span class="done DONE">DONE</span> Model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MarkH">MarkH</span></span></h3>
<div class="outline-text-3" id="text-org75f54a9">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> Using include/exclude projects make the snpattributes which are missing internal for b53</li>
</ul>
</div>
</div>
