project_planning/unidb.org
** DONE FeatureLocation Patch 
- [X] Truncate apidb.featurelocation
  #+begin_src sql
  truncate table apidb.featurelocation;
  #+end_src 
- [X] remove orf code from GUSTableLoader
- [X] make new Temporary apidb.databasetablemapping (decode inc->053n) and make indexe and delete rows from apidb.databasetablemapping for featurelocation
  #+begin_src sql
    create table apidb.databasetablemappingPatch as 
    select database_table_mapping_id
         , decode(database_orig, 'cryp-inc', 'cryp053n',
                                 'giar-inc', 'giar053n',
                                 'ameb-inc', 'ameb053n',
                                 'piro-inc', 'piro053n',
                                 'toxo-inc', 'toxo053n',
                                 'vect-inc', 'vect053n',
                                 'host-inc', 'host053n',
                                 'tryp-inc', 'tryp053n',
                                 'tvag-inc', 'tvag053n',
                                 'fung-inc', 'fung053n',
                                 'plas-inc', 'plas053n',
                                 'micr-inc', 'micr053n', 'ERROR') as database_orig
         , table_name
         , primary_key_orig
         , primary_key
         , modification_date
         , user_read
         , user_write
         , group_read
         , group_write
         , other_read
         , other_write
         , row_user_id
         , row_group_id
         , row_project_id
         , row_alg_invocation_id
    from apidb.databasetablemapping
    where table_name !=  'ApiDB::FeatureLocation';
  #+end_src
- [X] rename table (log in as apidb user)
  #+begin_src sql
    rename databasetablemapping to databasetablemapping_old
    rename databasetablemappingpatch to databasetablemapping
  #+end_src	
- [X] add indexes
  #+begin_src sql
    GRANT INSERT, SELECT, UPDATE, DELETE ON ApiDB.DatabaseTableMapping TO gus_w;
    GRANT SELECT ON ApiDB.DatabaseTableMapping TO gus_r;
    ALTER TABLE ApiDB.DatabaseTableMapping ADD CONSTRAINT database_map_tab2_pk PRIMARY KEY (database_table_mapping_id);
    CREATE INDEX apidb.db_tbl_map_tab2_idx ON ApiDB.DatabaseTableMapping (database_orig, table_name, primary_key_orig, primary_key) tablespace indx;
#+end_src
- [X] Run plugin manually for FeatureLocation (can we use direct path mode?)
  #+begin_src bash
    ga ApiCommonData::Load::Plugin::InsertUniDB --database piro053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/piro --mode load --commit ;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database ameb053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/ameb --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database cryp053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/cryp --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database giar053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/giar --mode load --commit ;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database host053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/host --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database micr053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/micr --mode load --commit ;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database plas053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/plas --mode load --commit ;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database toxo053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/toxo --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database tvag053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/tvag --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database tryp053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/tryp --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database fung053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/fung --mode load --commit;
    ga ApiCommonData::Load::Plugin::InsertUniDB --database vect053n --table_reader 'ApiCommonData::Load::GUSTableReader' --logDir /home/jbrestel/tmp/featureLocationPatch/vect --mode load --commit;
    #+end_src
- [X] decode 053n -> inc
** DONE MassSpecFeature Patch
- [X] update string6 to source_id to retain orig source_id 
  #+begin_src sql
   update dots.aafeatureimp 
   set string6 = source_id
   where subclass_view = 'MassSpecFeature';;
  #+end_src
- [X] use mapping table to update source_id:  yew:~/patches/patchMassSpecFeature.pl
- [X] Patch uni-inc  
** Punt 
1. SequenceVariations were not loaded;
   - tables on snp record page
   - one or two snp attributes 
2. Intron Junctions
   - jbrowse track (turn off)
3. User Datasets (installed into one app db only)
4. Llinas Mass Spec Profiles
* B54 :JohnB:Wei:
** DONE Genomics Workflow Changes
- [X] Add other 2 SNP Attributes which are being added by tuning manager
- [X] Required rebuild for all snp datasets 

** DONE Bulk Loader for SNP / Seqvars
** DONE Add Mass Spec profile (Llinas) [[redmine:45318][redmine:45318]]
