project_planning/unidb.html
<div id="outline-container-org55270a5" class="outline-3">
<h3 id="org55270a5"><span class="done DONE">DONE</span> FeatureLocation Patch</h3>
<div class="outline-text-3" id="text-org55270a5">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> <p>
Truncate apidb.featurelocation
</p>
<div class="org-src-container">
<pre class="src src-sql">truncate <span class="org-keyword">table</span> apidb.featurelocation;
</pre>
</div></li>
<li class="on"><input type='checkbox' checked='checked' /> remove orf code from GUSTableLoader</li>
<li class="on"><input type='checkbox' checked='checked' /> <p>
make new Temporary apidb.databasetablemapping (decode inc-&gt;053n) and make indexe and delete rows from apidb.databasetablemapping for featurelocation
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">apidb.databasetablemappingPatch</span> <span class="org-keyword">as</span> 
<span class="org-keyword">select</span> database_table_mapping_id
     , decode(database_orig, <span class="org-string">'cryp-inc'</span>, <span class="org-string">'cryp053n'</span>,
                             <span class="org-string">'giar-inc'</span>, <span class="org-string">'giar053n'</span>,
                             <span class="org-string">'ameb-inc'</span>, <span class="org-string">'ameb053n'</span>,
                             <span class="org-string">'piro-inc'</span>, <span class="org-string">'piro053n'</span>,
                             <span class="org-string">'toxo-inc'</span>, <span class="org-string">'toxo053n'</span>,
                             <span class="org-string">'vect-inc'</span>, <span class="org-string">'vect053n'</span>,
                             <span class="org-string">'host-inc'</span>, <span class="org-string">'host053n'</span>,
                             <span class="org-string">'tryp-inc'</span>, <span class="org-string">'tryp053n'</span>,
                             <span class="org-string">'tvag-inc'</span>, <span class="org-string">'tvag053n'</span>,
                             <span class="org-string">'fung-inc'</span>, <span class="org-string">'fung053n'</span>,
                             <span class="org-string">'plas-inc'</span>, <span class="org-string">'plas053n'</span>,
                             <span class="org-string">'micr-inc'</span>, <span class="org-string">'micr053n'</span>, <span class="org-string">'ERROR'</span>) <span class="org-keyword">as</span> database_orig
     , <span class="org-keyword">table_name</span>
     , primary_key_orig
     , primary_key
     , modification_date
     , user_read
     , user_write
     , group_read
     , group_write
     , other_read
     , other_write
     , row_user_id
     , row_group_id
     , row_project_id
     , row_alg_invocation_id
<span class="org-keyword">from</span> apidb.databasetablemapping
<span class="org-keyword">where</span> <span class="org-keyword">table_name</span> !=  <span class="org-string">'ApiDB::FeatureLocation'</span>;
</pre>
</div></li>
<li class="on"><input type='checkbox' checked='checked' /> <p>
rename table (log in as apidb user)
</p>
<div class="org-src-container">
<pre class="src src-sql">rename databasetablemapping <span class="org-keyword">to</span> databasetablemapping_old
rename databasetablemappingpatch <span class="org-keyword">to</span> databasetablemapping
</pre>
</div></li>
<li class="on"><input type='checkbox' checked='checked' /> <p>
add indexes
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">GRANT</span> <span class="org-keyword">INSERT</span>, <span class="org-keyword">SELECT</span>, <span class="org-keyword">UPDATE</span>, <span class="org-keyword">DELETE</span> <span class="org-keyword">ON</span> ApiDB.DatabaseTableMapping <span class="org-keyword">TO</span> gus_w;
<span class="org-keyword">GRANT</span> <span class="org-keyword">SELECT</span> <span class="org-keyword">ON</span> ApiDB.DatabaseTableMapping <span class="org-keyword">TO</span> gus_r;
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> <span class="org-function-name">ApiDB.DatabaseTableMapping</span> <span class="org-keyword">ADD</span> <span class="org-keyword">CONSTRAINT</span> database_map_tab2_pk <span class="org-keyword">PRIMARY</span> <span class="org-keyword">KEY</span> (database_table_mapping_id);
<span class="org-keyword">CREATE</span> INDEX apidb.db_tbl_map_tab2_idx <span class="org-keyword">ON</span> ApiDB.DatabaseTableMapping (database_orig, <span class="org-keyword">table_name</span>, primary_key_orig, primary_key) tablespace indx;
</pre>
</div></li>
<li class="on"><input type='checkbox' checked='checked' /> <p>
Run plugin manually for FeatureLocation (can we use direct path mode?)
</p>
<div class="org-src-container">
<pre class="src src-bash">ga ApiCommonData::Load::Plugin::InsertUniDB --database piro053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/piro --mode load --commit ;
ga ApiCommonData::Load::Plugin::InsertUniDB --database ameb053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/ameb --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database cryp053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/cryp --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database giar053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/giar --mode load --commit ;
ga ApiCommonData::Load::Plugin::InsertUniDB --database host053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/host --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database micr053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/micr --mode load --commit ;
ga ApiCommonData::Load::Plugin::InsertUniDB --database plas053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/plas --mode load --commit ;
ga ApiCommonData::Load::Plugin::InsertUniDB --database toxo053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/toxo --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database tvag053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/tvag --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database tryp053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/tryp --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database fung053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/fung --mode load --commit;
ga ApiCommonData::Load::Plugin::InsertUniDB --database vect053n --table_reader <span class="org-string">'ApiCommonData::Load::GUSTableReader'</span> --logDir /home/jbrestel/tmp/featureLocationPatch/vect --mode load --commit;
</pre>
</div></li>
<li class="on"><input type='checkbox' checked='checked' /> decode 053n -&gt; inc</li>
</ul>
</div>
</div>
<div id="outline-container-orgff9a23d" class="outline-3">
<h3 id="orgff9a23d"><span class="done DONE">DONE</span> MassSpecFeature Patch</h3>
<div class="outline-text-3" id="text-orgff9a23d">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> <p>
update string6 to source_id to retain orig source_id 
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> dots.aafeatureimp 
<span class="org-keyword">set</span> string6 = source_id
<span class="org-keyword">where</span> subclass_view = <span class="org-string">'MassSpecFeature'</span>;;
</pre>
</div></li>
<li class="on"><input type='checkbox' checked='checked' /> use mapping table to update source_id:  yew:~/patches/patchMassSpecFeature.pl</li>
<li class="on"><input type='checkbox' checked='checked' /> Patch uni-inc</li>
</ul>
</div>
</div>
<div id="outline-container-org98ebdaa" class="outline-3">
<h3 id="org98ebdaa">Punt</h3>
<div class="outline-text-3" id="text-org98ebdaa">
<ol class="org-ol">
<li>SequenceVariations were not loaded;
<ul class="org-ul">
<li>tables on snp record page</li>
<li>one or two snp attributes</li>
</ul></li>
<li>Intron Junctions
<ul class="org-ul">
<li>jbrowse track (turn off)</li>
</ul></li>
<li>User Datasets (installed into one app db only)</li>
<li>Llinas Mass Spec Profiles</li>
</ol>
</div>
</div>
</section>
<section id="outline-container-org7cdc4b4" class="outline-2">
<h2 id="org7cdc4b4">B54&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnB">JohnB</span>&#xa0;<span class="WeiL">WeiL</span></span></h2>
<div class="outline-text-2" id="text-org7cdc4b4">
</div>
<div id="outline-container-org6379634" class="outline-3">
<h3 id="org6379634"><span class="done DONE">DONE</span> Genomics Workflow Changes</h3>
<div class="outline-text-3" id="text-org6379634">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> Add other 2 SNP Attributes which are being added by tuning manager</li>
<li class="on"><input type='checkbox' checked='checked' /> Required rebuild for all snp datasets</li>
</ul>
</div>
</div>

<div id="outline-container-org2f51c24" class="outline-3">
<h3 id="org2f51c24"><span class="done DONE">DONE</span> Bulk Loader for SNP / Seqvars</h3>
</div>
<div id="outline-container-org2a46de9" class="outline-3">
<h3 id="org2a46de9"><span class="done DONE">DONE</span> Add Mass Spec profile (Llinas) <a href="https://redmine.apidb.org/issues/45318">redmine:45318</a></h3>
</div>
