project_planning/unidb.html
<div id="outline-container-org6075e7d" class="outline-3">
<h3 id="org6075e7d"><span class="done DONE">DONE</span> Update SRes.Taxon and SRes.TaxonName with most recent  version of NCBI Taxonomy</h3>
<div class="outline-text-3" id="text-org6075e7d">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> Update NCBI Taxonomy</li>
<li class="on"><input type='checkbox' checked='checked' /> Test Taxonomy Update</li>
<li class="on"><input type='checkbox' checked='checked' /> Run Tuning manager</li>
</ul>
</div>
</div>
<div id="outline-container-orgb487704" class="outline-3">
<h3 id="orgb487704"><span class="done DONE">DONE</span> Undo unidbcomponents</h3>
</div>
