project_planning/unidb.html
<div id="outline-container-org4696329" class="outline-3">
<h3 id="org4696329"><span class="done DONE">DONE</span> Patch ids for other tables ( uni-inc, uni054n )</h3>
<div class="outline-text-3" id="text-org4696329">
<ul class="org-ul">
<li><p>
ApiDB.AGPPiece
</p>
<ul class="org-ul">
<li>external_database_release_id</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 27173 <span class="org-keyword">where</span> external_database_release_id = 401 <span class="org-keyword">and</span> row_project_id = 42;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32430 <span class="org-keyword">where</span> external_database_release_id = 718 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32431 <span class="org-keyword">where</span> external_database_release_id = 729 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32337 <span class="org-keyword">where</span> external_database_release_id = 747 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32591 <span class="org-keyword">where</span> external_database_release_id = 720 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32248 <span class="org-keyword">where</span> external_database_release_id = 722 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32155 <span class="org-keyword">where</span> external_database_release_id = 745 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32532 <span class="org-keyword">where</span> external_database_release_id = 749 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32596 <span class="org-keyword">where</span> external_database_release_id = 758 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32247 <span class="org-keyword">where</span> external_database_release_id = 717 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32249 <span class="org-keyword">where</span> external_database_release_id = 727 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32335 <span class="org-keyword">where</span> external_database_release_id = 732 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32434 <span class="org-keyword">where</span> external_database_release_id = 744 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32254 <span class="org-keyword">where</span> external_database_release_id = 752 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32338 <span class="org-keyword">where</span> external_database_release_id = 753 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32085 <span class="org-keyword">where</span> external_database_release_id = 755 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32086 <span class="org-keyword">where</span> external_database_release_id = 759 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 28137 <span class="org-keyword">where</span> external_database_release_id = 1142 <span class="org-keyword">and</span> row_project_id = 43;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32082 <span class="org-keyword">where</span> external_database_release_id = 736 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32252 <span class="org-keyword">where</span> external_database_release_id = 742 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32435 <span class="org-keyword">where</span> external_database_release_id = 750 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32595 <span class="org-keyword">where</span> external_database_release_id = 754 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32436 <span class="org-keyword">where</span> external_database_release_id = 756 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32529 <span class="org-keyword">where</span> external_database_release_id = 723 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32080 <span class="org-keyword">where</span> external_database_release_id = 725 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32251 <span class="org-keyword">where</span> external_database_release_id = 737 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32432 <span class="org-keyword">where</span> external_database_release_id = 739 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32084 <span class="org-keyword">where</span> external_database_release_id = 751 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 28066 <span class="org-keyword">where</span> external_database_release_id = 1143 <span class="org-keyword">and</span> row_project_id = 43;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 27647 <span class="org-keyword">where</span> external_database_release_id = 1144 <span class="org-keyword">and</span> row_project_id = 43;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32250 <span class="org-keyword">where</span> external_database_release_id = 730 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32530 <span class="org-keyword">where</span> external_database_release_id = 733 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32154 <span class="org-keyword">where</span> external_database_release_id = 734 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32593 <span class="org-keyword">where</span> external_database_release_id = 735 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32257 <span class="org-keyword">where</span> external_database_release_id = 797 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 27961 <span class="org-keyword">where</span> external_database_release_id = 1141 <span class="org-keyword">and</span> row_project_id = 43;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 38633 <span class="org-keyword">where</span> external_database_release_id = 3883 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32333 <span class="org-keyword">where</span> external_database_release_id = 719 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32699 <span class="org-keyword">where</span> external_database_release_id = 724 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32334 <span class="org-keyword">where</span> external_database_release_id = 728 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32081 <span class="org-keyword">where</span> external_database_release_id = 731 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32336 <span class="org-keyword">where</span> external_database_release_id = 738 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32083 <span class="org-keyword">where</span> external_database_release_id = 740 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32594 <span class="org-keyword">where</span> external_database_release_id = 746 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 27658 <span class="org-keyword">where</span> external_database_release_id = 1145 <span class="org-keyword">and</span> row_project_id = 43;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32153 <span class="org-keyword">where</span> external_database_release_id = 721 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32592 <span class="org-keyword">where</span> external_database_release_id = 726 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32433 <span class="org-keyword">where</span> external_database_release_id = 741 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32531 <span class="org-keyword">where</span> external_database_release_id = 743 <span class="org-keyword">and</span> row_project_id = 46;
       <span class="org-keyword">update</span> apidb.agppiece <span class="org-keyword">set</span> external_database_release_id = 32700 <span class="org-keyword">where</span> external_database_release_id = 757 <span class="org-keyword">and</span> row_project_id = 46;
</pre>
</div>
<ul class="org-ul">
<li><p>
ApiDB.GOSubset
</p>
<ul class="org-ul">
<li>external_database_release_id</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 425 <span class="org-keyword">where</span> external_database_release_id = 47 <span class="org-keyword">and</span> row_project_id = 48;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 2467 <span class="org-keyword">where</span> external_database_release_id = 22 <span class="org-keyword">and</span> row_project_id = 43;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 206 <span class="org-keyword">where</span> external_database_release_id = 48 <span class="org-keyword">and</span> row_project_id = 45;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 2467 <span class="org-keyword">where</span> external_database_release_id = 10 <span class="org-keyword">and</span> row_project_id = 42;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 425 <span class="org-keyword">where</span> external_database_release_id = 46 <span class="org-keyword">and</span> row_project_id = 4;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 425 <span class="org-keyword">where</span> external_database_release_id = 45 <span class="org-keyword">and</span> row_project_id = 22;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 425 <span class="org-keyword">where</span> external_database_release_id = 25 <span class="org-keyword">and</span> row_project_id = 5;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 4910 <span class="org-keyword">where</span> external_database_release_id = 46 <span class="org-keyword">and</span> row_project_id = 41;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 206 <span class="org-keyword">where</span> external_database_release_id = 46 <span class="org-keyword">and</span> row_project_id = 3;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 2467 <span class="org-keyword">where</span> external_database_release_id = 45 <span class="org-keyword">and</span> row_project_id = 46;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 2467 <span class="org-keyword">where</span> external_database_release_id = 19 <span class="org-keyword">and</span> row_project_id = 21;
<span class="org-keyword">update</span> apidb.gosubset <span class="org-keyword">set</span> external_database_release_id = 425 <span class="org-keyword">where</span> external_database_release_id = 112 <span class="org-keyword">and</span> row_project_id = 47;
</pre>
</div></li>
</ul></li>
<li><p>
ApiDB.IntronJunction
</p>
<ul class="org-ul">
<li>na_sequence_id</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">projectIdDatabase</span> <span class="org-keyword">as</span>
<span class="org-keyword">select</span> project_id
     , decode(<span class="org-builtin">lower</span>(substr(<span class="org-keyword">name</span>, 1,4)),
                    <span class="org-string">'tric'</span>, <span class="org-string">'tvag'</span>,
                    <span class="org-string">'amoe'</span>, <span class="org-string">'ameb'</span>,
                    <span class="org-string">'trit'</span>, <span class="org-string">'tryp'</span>,
                    <span class="org-builtin">lower</span>(substr(<span class="org-keyword">name</span>, 1,4))) || <span class="org-string">'-inc'</span> <span class="org-keyword">as</span> database_orig
 <span class="org-keyword">from</span> core.projectinfo
 <span class="org-keyword">where</span> project_id <span class="org-keyword">in</span> (43,42,41,44,45,21,4,48,3,22,46,47,5);

 <span class="org-keyword">create</span> <span class="org-keyword">table</span> <span class="org-function-name">apidb.intronjunction_tmp</span> <span class="org-keyword">as</span> 
 <span class="org-keyword">select</span> j.intron_junction_id
 , j.protocol_app_node_id
 , s_map.primary_key <span class="org-keyword">as</span> na_sequence_id
 ,j.segment_start
 ,j.segment_end
 , j.is_reversed
 , j.unique_reads
 , j.nu_reads
 , j.modification_date
 , j.user_read
 , j.user_write
 , j.group_read
 , j.group_write
 , j.other_read
 , j.other_write
 , j.row_user_id
 , j.row_group_id
 , j.row_project_id
 , j.row_alg_invocation_id
 <span class="org-keyword">from</span> apidb.intronjunction j
 , projectiddatabase pd
 , (<span class="org-keyword">select</span> * <span class="org-keyword">from</span> apidb.databasetablemapping <span class="org-keyword">where</span> <span class="org-keyword">table_name</span> = <span class="org-string">'DoTS::NASequenceImp'</span>) s_map
 <span class="org-keyword">where</span> j.row_project_id = pd.project_id
 <span class="org-keyword">and</span> pd.DATABASE_ORIG = s_map.database_orig
 <span class="org-keyword">and</span> j.na_sequence_id = s_map.primary_key_orig;


 rename intronjunction <span class="org-keyword">to</span> intronjunction_old;
 rename intronjunction_tmp <span class="org-keyword">to</span> intronjunction;

 <span class="org-keyword">alter</span> <span class="org-keyword">table</span> <span class="org-function-name">apidb.intronjunction</span> <span class="org-keyword">add</span> <span class="org-keyword">constraint</span> injunc_pk <span class="org-keyword">primary</span> <span class="org-keyword">key</span> (intron_junction_id);
 <span class="org-keyword">alter</span> <span class="org-keyword">table</span> <span class="org-function-name">apidb.intronjunction</span> <span class="org-keyword">add</span> <span class="org-keyword">constraint</span> injunc_pan <span class="org-keyword">foreign</span> <span class="org-keyword">key</span> (protocol_app_node_id) <span class="org-keyword">references</span> study.protocolappnode;;
 <span class="org-keyword">alter</span> <span class="org-keyword">table</span> <span class="org-function-name">apidb.intronjunction</span> <span class="org-keyword">add</span> <span class="org-keyword">constraint</span> injunc_seq <span class="org-keyword">foreign</span> <span class="org-keyword">key</span> (na_sequence_id) <span class="org-keyword">references</span> dots.nasequenceimp;


 <span class="org-keyword">GRANT</span> <span class="org-keyword">insert</span>, <span class="org-keyword">select</span>, <span class="org-keyword">update</span>, <span class="org-keyword">delete</span> <span class="org-keyword">ON</span> apidb.IntronJunction <span class="org-keyword">TO</span> gus_w;                                                                             
 <span class="org-keyword">GRANT</span> <span class="org-keyword">select</span> <span class="org-keyword">ON</span> apidb.IntronJunction <span class="org-keyword">TO</span> gus_r;                                                                                                     

 <span class="org-keyword">CREATE</span> INDEX apidb.IntJunc_loc2_ix                                                                                                                  
 <span class="org-keyword">ON</span> apidb.IntronJunction                                                                                                                            
   (na_sequence_id, segment_start, segment_end, is_reversed)                                                                                       
   TABLESPACE indx;                                                                                                                                
 <span class="org-keyword">CREATE</span> INDEX apidb.injun_rev2_ix0 <span class="org-keyword">ON</span> apidb.IntronJunction (protocol_app_node_id, intron_junction_id) TABLESPACE indx; 
</pre>
</div></li>
</ul>
</div>
</div>
</section>
