project_planning/unidb.org
* Beta Release                                       :Mark:JohnI:JohnB:Bindu:
** Automated QA Process
*** compare list of wdk Searches, Attributes, and Tables in UniDB to union of all component projects :JohnB:
#+begin_src example
perl includedWdkElements.pl --check_params --unidb_website beta.veupathdb.org
#+end_src
- this test can also run param queries and compare values (use --check_params flag)
- [[https://github.com/VEuPathDB/FunctionalTests/blob/main/bin/includedWdkElements.pl]]
- [ ] Record expected and Actual Results
*** Selenium Tests for Search Pages :Bindu:
*** Compare attribute tables :JohnI:
- [ ] using sql minus operation, compare production attribute tables in eupa database to production uni database (example eupa054n to uni054n)
- [ ] Record expected and Actual Results
*** Test Record page tables against component databases :JohnB:
#+begin_src example
perl regresssionTestForRecordQueries.pl --dir /home/jbrestel/unidb/record_queries_output --instance_suffix 054n >rq.err 2>&1
#+end_src
- [ ] foreach record table, run the sql and compare counts (union for all components)
- [ ] address faiures
- [ ] Record expected and Actual Results
** Performance Tests :Mark:Steve:Cristina:
*** Webserive queries for Performance Tests :MarkH:
- [ ] compare plasmodb.org (b52) to feature.veupathdb.org
- [ ] Record expected and Actual Results

* Future Releases :JohnI:JohnB:MarkH:Bindu:
** TODO Schema Changes
- [ ] use perl script to automatically add "database_orig" and "primary_key_orig" in installer
- [X] add 3 new fields to SRes.OntologySynonym
** Plugin Changes for DatabaseMapping fields
- [ ] Database Mapping Table
  - [ ] Global Rows still need to populate existing Database Mapping Table
  - [ ] Component Specific Rows should populate the 2 new fields in the primary table
  - [ ] Undo needs to work BOTH ways because of legacy data in genomics sites
  - [ ] Existing queries using databasemapping table need to be union of both ways because of legacy data in genomics sites
- [ ] Address cleanup steps for failures
  - [ ] Database Specific / Non Global we get for free as there is no clean up needed after above change
  - [ ] For Global Rows, we must delete the apidb.databasetablemapping rows for this table + alg_invocation
    #+begin_src sql
	  delete apidb.databasetablemapping where database_orig = ? and table_name = ? and row_alg_invocation_id = ?
    #+end_src
  - [ ] update how we find unidb aware tables
    #+begin_src sql
      select ti.name as table_name
           , di.name as database_name
           , ti.primary_key_column
      from core.tableinfo ti, core.databaseinfo di,
           (select owner, table_name
           from all_tab_columns 
           where column_name in ('DATABASE_ORIG', 'PRIMARY_KEY_ORIG')
           and owner != 'EDA' -- TEMPORARY
           group by owner, table_name
           having count(*) = 2) wit
      where ti.database_id = di.database_id
      and upper(wit.owner) = upper(di.name)
      and upper(wit.table_name) = upper(ti.name)
      and ti.VIEW_ON_TABLE_ID is null
    #+end_src
** Tuning Manager
*** Why so many dependencies on DatasetPresenter?
*** Intron Junctions [[redmine:45717][redmine:45717]]
*** Move Organism Specific to workflow
*** Comparative Genomics ???
** Model (JBrowse, WDK, WS Plugins, ...)
- [ ] Profile Similarity (Inject this instead of hard coding)
- [ ] Phenotype (Injection)
- [ ] Cellular Location (TriTyp, Giardia?) (Injection)
- [ ] MassSpec
  - [ ] Change tuning manager and model to use mass_spec_summary_id in place of source_id (grep dots.massspecfeature)
  - [ ] Confirm with data loaders (update ApiCommonData)    
- [ ] remove project_id from webservice queries (once we remove federated portal)
- [ ] Text Searches (will site search fix these?)
** wgcna (host /pathogen)


* SOP for schema changes
- [ ] How to handle schema changes?
  - [ ] add columns
  - [ ] add tables
  - [ ] alter size of columns
* Use Cases For Unified Database
- fully functional portal (veupathdb.org)
- host / pathogen / vector
- user defined organism preferences
- Fewer prod db instances
** ebi2GUS
- given mysql dump (init.sql), the container will fire up mariadb server, run the init.sql, will run dumpGUS.pl which creates a set of files (one file per GUS Table)
- new branch needed
  - change to GUS schema ( ~ 40 tables for "core genome")
  - changes to input schema
  - changes to the perl api





