project_planning/unidb.html

<section id="outline-container-orgdd1435b" class="outline-2">
<h2 id="orgdd1435b">Beta Release&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MarkH">MarkH</span>&#xa0;<span class="JohnI">JohnI</span>&#xa0;<span class="JohnB">JohnB</span>&#xa0;<span class="BinduG">BinduG</span></span></h2>
<div class="outline-text-2" id="text-orgdd1435b">
</div>
<div id="outline-container-orgbf1914a" class="outline-3">
<h3 id="orgbf1914a">Automated QA Process</h3>
<div class="outline-text-3" id="text-orgbf1914a">
</div>
<div id="outline-container-org87c7e02" class="outline-4">
<h4 id="org87c7e02">compare list of wdk Searches, Attributes, and Tables in UniDB to union of all component projects&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnB">JohnB</span></span></h4>
<div class="outline-text-4" id="text-org87c7e02">
<div class="org-src-container">
<pre class="src src-example">perl includedWdkElements.pl --check_params --unidb_website beta.veupathdb.org
</pre>
</div>
<ul class="org-ul">
<li>this test can also run param queries and compare values (use &#x2013;check_params flag)</li>
<li><a href="https://github.com/VEuPathDB/FunctionalTests/blob/main/bin/includedWdkElements.pl">https://github.com/VEuPathDB/FunctionalTests/blob/main/bin/includedWdkElements.pl</a></li>
<li class="on"><input type='checkbox' checked='checked' /> Record expected and Actual Results</li>
</ul>
</div>
</div>
<div id="outline-container-orgc8e8c46" class="outline-4">
<h4 id="orgc8e8c46">Selenium Tests for Search Pages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BinduG">BinduG</span></span></h4>
</div>
<div id="outline-container-orgb2713f6" class="outline-4">
<h4 id="orgb2713f6">Compare attribute tables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnI">JohnI</span></span></h4>
<div class="outline-text-4" id="text-orgb2713f6">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> using sql minus operation, compare production attribute tables in eupa database to production uni database (example eupa054n to uni054n)</li>
<li class="on"><input type='checkbox' checked='checked' /> Record expected and Actual Results</li>
</ul>
</div>
</div>
<div id="outline-container-org0a52929" class="outline-4">
<h4 id="org0a52929">Test Record page tables against component databases&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnB">JohnB</span></span></h4>
<div class="outline-text-4" id="text-org0a52929">
<div class="org-src-container">
<pre class="src src-example">perl regresssionTestForRecordQueries.pl --dir /home/jbrestel/unidb/record_queries_output --instance_suffix 054n &gt;rq.err 2&gt;&amp;1
</pre>
</div>
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> foreach record table, run the sql and compare counts (union for all components)</li>
<li class="off"><input type='checkbox' /> address faiures</li>
<li class="on"><input type='checkbox' checked='checked' /> Record expected and Actual Results</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6acd342" class="outline-3">
<h3 id="org6acd342">Performance Tests&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MarkH">MarkH</span>&#xa0;<span class="SteveF">SteveF</span>&#xa0;<span class="CristinaA">CristinaA</span></span></h3>
<div class="outline-text-3" id="text-org6acd342">
</div>
<div id="outline-container-org234e5bd" class="outline-4">
<h4 id="org234e5bd">Webserive queries for Performance Tests&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MarkH">MarkH</span></span></h4>
<div class="outline-text-4" id="text-org234e5bd">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> compare plasmodb.org (b52) to feature.veupathdb.org</li>
<li class="on"><input type='checkbox' checked='checked' /> Record expected and Actual Results</li>
<li>ApicommonModel/Model/bin/performanceTestSearchesUniDb script</li>
</ul>
</div>
</div>
</div>
</section>
<section id="outline-container-orgb0725ae" class="outline-2">
<h2 id="orgb0725ae">Future Releases&#xa0;&#xa0;&#xa0;<span class="tag"><span class="JohnI">JohnI</span>&#xa0;<span class="JohnB">JohnB</span>&#xa0;<span class="MarkH">MarkH</span>&#xa0;<span class="BinduG">BinduG</span></span></h2>
<div class="outline-text-2" id="text-orgb0725ae">
</div>
<div id="outline-container-orgb275df2" class="outline-3">
<h3 id="orgb275df2"><span class="todo TODO">TODO</span> Schema Changes</h3>
<div class="outline-text-3" id="text-orgb275df2">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> use perl script to automatically add &ldquo;database_orig&rdquo; and &ldquo;primary_key_orig&rdquo; in installer</li>
<li class="on"><input type='checkbox' checked='checked' /> add 3 new fields to SRes.OntologySynonym</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb1e3cb" class="outline-3">
<h3 id="orgbb1e3cb">Plugin Changes for DatabaseMapping fields</h3>
<div class="outline-text-3" id="text-orgbb1e3cb">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Database Mapping Table
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Global Rows still need to populate existing Database Mapping Table</li>
<li class="off"><input type='checkbox' /> Component Specific Rows should populate the 2 new fields in the primary table</li>
<li class="off"><input type='checkbox' /> Undo needs to work BOTH ways because of legacy data in genomics sites</li>
<li class="off"><input type='checkbox' /> Existing queries using databasemapping table need to be union of both ways because of legacy data in genomics sites</li>
</ul></li>
<li class="off"><input type='checkbox' /> Address cleanup steps for failures
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Database Specific / Non Global we get for free as there is no clean up needed after above change</li>
<li class="off"><input type='checkbox' /> <p>
For Global Rows, we must delete the apidb.databasetablemapping rows for this table + alg_invocation
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">delete</span> apidb.databasetablemapping <span class="org-keyword">where</span> database_orig = ? <span class="org-keyword">and</span> <span class="org-keyword">table_name</span> = ? <span class="org-keyword">and</span> row_alg_invocation_id = ?
</pre>
</div></li>
<li class="off"><input type='checkbox' /> <p>
update how we find unidb aware tables
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">select</span> ti.<span class="org-keyword">name</span> <span class="org-keyword">as</span> <span class="org-keyword">table_name</span>
     , di.<span class="org-keyword">name</span> <span class="org-keyword">as</span> database_name
     , ti.primary_key_column
<span class="org-keyword">from</span> core.tableinfo ti, core.databaseinfo di,
     (<span class="org-keyword">select</span> owner, <span class="org-keyword">table_name</span>
     <span class="org-keyword">from</span> all_tab_columns 
     <span class="org-keyword">where</span> <span class="org-keyword">column_name</span> <span class="org-keyword">in</span> (<span class="org-string">'DATABASE_ORIG'</span>, <span class="org-string">'PRIMARY_KEY_ORIG'</span>)
     <span class="org-keyword">and</span> owner != <span class="org-string">'EDA'</span> <span class="org-comment">-- TEMPORARY</span>
     <span class="org-keyword">group</span> <span class="org-keyword">by</span> owner, <span class="org-keyword">table_name</span>
     <span class="org-keyword">having</span> <span class="org-builtin">count</span>(*) = 2) wit
<span class="org-keyword">where</span> ti.database_id = di.database_id
<span class="org-keyword">and</span> <span class="org-builtin">upper</span>(wit.owner) = <span class="org-builtin">upper</span>(di.<span class="org-keyword">name</span>)
<span class="org-keyword">and</span> <span class="org-builtin">upper</span>(wit.<span class="org-keyword">table_name</span>) = <span class="org-builtin">upper</span>(ti.<span class="org-keyword">name</span>)
<span class="org-keyword">and</span> ti.VIEW_ON_TABLE_ID <span class="org-keyword">is</span> <span class="org-keyword">null</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org512a0d8" class="outline-3">
<h3 id="org512a0d8">Tuning Manager</h3>
<div class="outline-text-3" id="text-org512a0d8">
</div>
<div id="outline-container-org16e34cc" class="outline-4">
<h4 id="org16e34cc">Why so many dependencies on DatasetPresenter?</h4>
</div>
<div id="outline-container-org1323682" class="outline-4">
<h4 id="org1323682">Intron Junctions <a href="https://redmine.apidb.org/issues/45717">redmine:45717</a></h4>
</div>
<div id="outline-container-org74b8522" class="outline-4">
<h4 id="org74b8522">Move Organism Specific to workflow</h4>
</div>
<div id="outline-container-org04dc324" class="outline-4">
<h4 id="org04dc324">Comparative Genomics ???</h4>
</div>
</div>
<div id="outline-container-org7d26bb3" class="outline-3">
<h3 id="org7d26bb3">Model (JBrowse, WDK, WS Plugins, &#x2026;)</h3>
<div class="outline-text-3" id="text-org7d26bb3">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Profile Similarity (Inject this instead of hard coding)</li>
<li class="off"><input type='checkbox' /> Phenotype (Injection)</li>
<li class="off"><input type='checkbox' /> Cellular Location (TriTyp, Giardia?) (Injection)</li>
<li class="off"><input type='checkbox' /> MassSpec
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Change tuning manager and model to use mass_spec_summary_id in place of source_id (grep dots.massspecfeature)</li>
<li class="off"><input type='checkbox' /> Confirm with data loaders (update ApiCommonData)</li>
</ul></li>
<li class="off"><input type='checkbox' /> remove project_id from webservice queries (once we remove federated portal)</li>
<li class="off"><input type='checkbox' /> Text Searches (will site search fix these?)</li>
</ul>
</div>
</div>
<div id="outline-container-org43932e3" class="outline-3">
<h3 id="org43932e3">wgcna (host /pathogen)</h3>
</div>
</section>
<section id="outline-container-org5df38a4" class="outline-2">
<h2 id="org5df38a4">SOP for schema changes</h2>
<div class="outline-text-2" id="text-org5df38a4">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> How to handle schema changes?
<ul class="org-ul">
<li class="off"><input type='checkbox' /> add columns</li>
<li class="off"><input type='checkbox' /> add tables</li>
<li class="off"><input type='checkbox' /> alter size of columns</li>
</ul></li>
</ul>
</div>
</section>
<section id="outline-container-org9ee9c32" class="outline-2">
<h2 id="org9ee9c32">Use Cases For Unified Database</h2>
<div class="outline-text-2" id="text-org9ee9c32">
<ul class="org-ul">
<li>fully functional portal (veupathdb.org)</li>
<li>host / pathogen / vector</li>
<li>user defined organism preferences</li>
<li>Fewer prod db instances</li>
</ul>
</div>
<div id="outline-container-org7772408" class="outline-3">
<h3 id="org7772408">ebi2GUS</h3>
<div class="outline-text-3" id="text-org7772408">
<ul class="org-ul">
<li>given mysql dump (init.sql), the container will fire up mariadb server, run the init.sql, will run dumpGUS.pl which creates a set of files (one file per GUS Table)</li>
<li>new branch needed
<ul class="org-ul">
<li>change to GUS schema ( ~ 40 tables for &ldquo;core genome&rdquo;)</li>
<li>changes to input schema</li>
<li>changes to the perl api</li>
</ul></li>
</ul>
</div>
</div>
</section>
