project_planning/unidb.org
* Other Documentation
- [[https://docs.google.com/document/d/1K3ckE6hwN9r-Dp1Av_zDH5Jcr7ApbBjQ-7yJM1zk0bQ/edit][UniDB Design Document December 2019]]
- [[https://wiki.apidb.org/index.php/UniDB%20Workflow][Wiki / Technical info about running workflow]]
* Table Reader(s)
- [[~/project_home/ApiCommonData/Load/lib/perl/UniDBTableReader.pm][UniDB Table Reader]]
  - initial thinking was that sql queries would map input->output
- [[~/project_home/ApiCommonData/Load/lib/perl/GUSTableReader.pm][GUSTableReader]]
  - inpput is a GUS oracle instance
  - queries here are like "select * from $table"
- [[~/project_home/ApiCommonData/Load/lib/perl/EBITableReader.pm][EBI Table Reader]]
  - input is flat files
  - no queries.  the translation from chado/mysql->GUS is done via [[https://github.com/VEuPathDB/ebi2gus/][ebi2gus]] and uses the E! perl API
    - [[~/project_home/ebi2gus/Dockerfile]]
    - [[~/project_home/ebi2gus/lib/perl/EBIParser.pm]]
    - [[~/project_home/ebi2gus/lib/perl/GUS/DoTS/GeneFeature.pm]]

