project_planning/unidb.html





<section id="outline-container-orgdcdcd2e" class="outline-2">
<h2 id="orgdcdcd2e">Other Documentation</h2>
<div class="outline-text-2" id="text-orgdcdcd2e">
<ul class="org-ul">
<li><a href="https://docs.google.com/document/d/1K3ckE6hwN9r-Dp1Av_zDH5Jcr7ApbBjQ-7yJM1zk0bQ/edit">UniDB Design Document December 2019</a></li>
<li><a href="https://wiki.apidb.org/index.php/UniDB%20Workflow">Wiki / Technical info about running workflow</a></li>
</ul>
</div>
</section>
<section id="outline-container-org45341d7" class="outline-2">
<h2 id="org45341d7">Table Reader(s)</h2>
<div class="outline-text-2" id="text-org45341d7">
<ul class="org-ul">
<li><a href="file:///github/home/project_home/ApiCommonData/Load/lib/perl/UniDBTableReader.pm">UniDB Table Reader</a>
<ul class="org-ul">
<li>initial thinking was that sql queries would map input-&gt;output</li>
</ul></li>
<li><a href="file:///github/home/project_home/ApiCommonData/Load/lib/perl/GUSTableReader.pm">GUSTableReader</a>
<ul class="org-ul">
<li>inpput is a GUS oracle instance</li>
<li>queries here are like &ldquo;select * from $table&rdquo;</li>
</ul></li>
<li><a href="file:///github/home/project_home/ApiCommonData/Load/lib/perl/EBITableReader.pm">EBI Table Reader</a>
<ul class="org-ul">
<li>input is flat files</li>
<li>no queries.  the translation from chado/mysql-&gt;GUS is done via <a href="https://github.com/VEuPathDB/ebi2gus/">ebi2gus</a> and uses the E! perl API
<ul class="org-ul">
<li><a href="file:///github/home/project_home/ebi2gus/Dockerfile">file:///github/home/project_home/ebi2gus/Dockerfile</a></li>
<li><a href="file:///github/home/project_home/ebi2gus/lib/perl/EBIParser.pm">file:///github/home/project_home/ebi2gus/lib/perl/EBIParser.pm</a></li>
<li><a href="file:///github/home/project_home/ebi2gus/lib/perl/GUS/DoTS/GeneFeature.pm">file:///github/home/project_home/ebi2gus/lib/perl/GUS/DoTS/GeneFeature.pm</a></li>
</ul></li>
</ul></li>
</ul>
</div>
</section>
</main>
</body>
</html>
